; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	image1 - mode
	thermograph0 - mode
	infrared3 - mode
	spectrograph4 - mode
	Star2 - direction
	GroundStation6 - direction
	Star9 - direction
	Star5 - direction
	Star11 - direction
	Star4 - direction
	Star8 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument2 spectrograph4)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite3 Star4)
	(have_image Star12 image1)
	(have_image Phenomenon13 image2)
	(have_image Star14 image1)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image2)
))

)

; plan
1. (turn_to satellite3 groundstation3 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite3 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite3 phenomenon15 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon15)
   goals met: 0 of 6
5. (turn_to satellite1 groundstation10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 6
6. (take_image satellite3 phenomenon15 instrument3 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 1 of 6
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (turn_to satellite1 phenomenon13 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 6
10. (take_image satellite1 phenomenon13 instrument1 image2)
   added: (have_image phenomenon13 image2)
   goals met: 2 of 6
11. (turn_to satellite1 star16 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star16)
   goals met: 2 of 6
12. (take_image satellite1 star16 instrument1 image2)
   added: (have_image star16 image2)
   goals met: 3 of 6
13. (turn_to satellite3 star12 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 star12)
   goals met: 3 of 6
14. (take_image satellite3 star12 instrument3 image1)
   added: (have_image star12 image1)
   goals met: 4 of 6
15. (turn_to satellite3 star14 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star14)
   goals met: 4 of 6
16. (take_image satellite3 star14 instrument3 image1)
   added: (have_image star14 image1)
   goals met: 5 of 6
17. (turn_to satellite3 star4 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star4)
   goals met: 6 of 6
